#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТабЧасть = Элементы.Товары;
	ТекущиеДанные = ТабЧасть.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаСообщения = "Изменилась колонка Количество";
	
	РасчитатьСуммуВСтроке(СтрокаСообщения, ТекущиеДанные);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РасчитатьСуммуВСтроке(ТекстСообщения, Строка)

	//Что то изменили
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сотрудник = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Сотрудник.Имя);
	Сообщение.Сообщить();

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()

	Пользователь = Новый Структура;
	Пользователь.Вставить("Имя", "Антон");
	Пользователь.Вставить("ДатаРождения", ТекущаяДата());
	Пользователь.Вставить("Стаж", 14);
	Пользователь.Вставить("Штатный", Истина);

	Возврат Пользователь;

КонецФункции
#КонецОбласти
